Documents/Матч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Матч</Name>
			<BasedOn>
				<xr:Item>Catalog.Стадионы</xr:Item>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Туры</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТурнирнаяТаблица</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стадион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стадионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗрителей</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗрителей</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пенальти</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставыКоманд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Игрок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/Календарь/Ext/Form/Module.bsl
&НаСервере
Процедура ИзображениеУстановить(ИгрокИлиМатч)
	Если ИгрокИлиМатч = ТекущийИгрок Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(ИгрокИлиМатч);
		ТекущийИгрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Изображение	= ИзображениеПолучить(МояКоманда);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия
	И Элементы.Список.ТекущиеДанные.Свойство("ЭтоИгрок")
	И Элементы.Список.ТекущиеДанные.ЭтоИгрок
	И Элементы.Список.ТекущиеДанные.Свойство("Ссылка")
	Тогда
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.Ссылка);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийИгрок) Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(МояКоманда);
		ТекущийИгрок	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокОбновитьНаСервере()
	Элементы.Период.Подсказка	= Строка(Период);

	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
	СписокУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	СписокУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
	ФотоПолучить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДниРожденияПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура ДатыУстановить()
	Период.Вариант		= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
	Если День(Период.ДатаОкончания) - День(Период.ДатаНачала) <= 3 Тогда
		Период.ДатаОкончания	= КонецМесяца(Период.ДатаОкончания + Сутки());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = ТекущийИгрок
	Тогда
		ТекущийИгрок	= Неопределено;
		ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Новости") = 0 Тогда
		ПодключитьОбработчикОжидания("НовостиОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "ЧтениеНовостей") = 0 Тогда
		Элементы.СтраницаНовости.Видимость = Параметр;
	ИначеЕсли СтрСравнить(ИмяСобытия, "Новости") = 0 Тогда
		Элементы.Новости.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("Команда",			?(ЗначениеЗаполнено(МояКоманда), МояКоманда, Неопределено));
	ФотоПолучить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Функция ИзображениеПолучить(Команда=Неопределено)
	Если Команда = Неопределено Тогда
		Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
	КонецЕсли;
	Возврат СерверныйФункции.ИзображениеПолучить(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда)
	СписокОбновить();
КонецПроцедуры

&НаСервере
Процедура СписокУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(ВыбраннаяСтрока, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Период.ДатаОкончания > ДобавитьМесяц(Период.ДатаНачала, 12) Тогда
		Период.ДатаОкончания = КонецГода(Период.ДатаНачала);
	Иначе
		ПодключитьОбработчикОжидания("СписокОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия, 0.1, 1), Истина);
		ПодключитьОбработчикОжидания("НовостиОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНовости, 0.1, 1), Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмпортИгрПоКалендарюНаСервере(Текст, Команда)
	Возврат СерверныйФункции.ИмпортИгрПоКалендарю(Текст, Команда);
КонецФункции

&НаКлиенте
Процедура ИмпортИгрПоКалендарю(Текст)
	Ответ	= ИмпортИгрПоКалендарюНаСервере(Текст, МояКоманда);
	Если Ответ > 0 Тогда
		НаКлиенте.Оповещение("Матчи");
		Сообщить(СтрШаблон("Добавлено/изменено событий: %1", Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгрПоСтроке(Текст)
	Возврат СерверныйФункции.ИмпортИгрПоСтроке2(Текст);
КонецФункции

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	Если ЗначениеЗаполнено(МояКоманда) Тогда
		Гиперссылка	= УРЛ;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), Гиперссылка, "Импорт календаря (iCal)");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйДокументПрочитан(ДополнительныеПараметры=Неопределено) Экспорт
	ИмпортИгрПоКалендарю(ТекстовыйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПродолжить(ФайлСуществует, ДополнительныеПараметры) Экспорт
	Если ФайлСуществует Тогда
		Попытка
			ТекстовыйДокумент.НачатьЧтение(Новый ОписаниеОповещения("ТекстовыйДокументПрочитан", ЭтотОбъект), ДополнительныеПараметры);
		Исключение
			СерверныйФункции.Логировать("Календарь.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ДополнительныеПараметры);
		КонецПопытки;
	Иначе
		Ответ = ИмпортИгрПоСтроке(ДополнительныеПараметры);
		Если Ответ > 0 Тогда
			НаКлиенте.Оповещение("Матчи");
			Сообщить(СтрШаблон("Добавлено событий: %1", Ответ));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога("ics");
КонецФункции

&НаКлиенте
Процедура Импорт(Гиперссылка, ДополнительныеПараметры=Неопределено) Экспорт
	Если Гиперссылка = Неопределено Тогда
		//
	ИначеЕсли ТипЗнч(Гиперссылка) = Тип("ОписаниеПомещенногоФайла") Тогда
		Импорт(Гиперссылка.СсылкаНаФайл.Файл.ПолноеИмя);
		
	ИначеЕсли ЭтоУРЛ(Гиперссылка) Тогда
		УРЛ		= Гиперссылка;
		Текст	= СкачатьПоСсылке(Гиперссылка);
		ИмпортИгрПоКалендарю(Текст);
	
	ИначеЕсли ПустаяСтрока(Гиперссылка) Тогда	// выбор файла ics
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("Импорт", ЭтотОбъект),,,, ПараметрыДиалога());
	Иначе
		Файл = Новый Файл(Гиперссылка);
		Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ИмпортПродолжить", ЭтотОбъект, Гиперссылка));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкачатьПоСсылке(Гиперссылка)
	Возврат СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
КонецФункции

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	Показать(Элементы.Список.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Показать(Ссылка, СтандартнаяОбработка=Ложь)
	Если Ссылка <> Неопределено Тогда
		НаКлиенте.Показать(Ссылка, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзображениеДефолт	= ИзображениеПолучить();
	
	Элементы.СтраницаНовости.Видимость = НаСервереПовторно.ЧтениеНовостей();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатыУстановить();
	МояКоманда		= МояКоманда();
	
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаСервере
Процедура НовостиУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Новости.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаСервере
Процедура НовостиОбновитьНаСервере()
	Если Элементы.СтраницаНовости.Видимость Тогда
		Элементы.Период.Подсказка	= Строка(Период);

		НовостиУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
		НовостиУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
		НовостиУстановитьЗначениеПараметра("МояКоманда",		Обернуть(МояКоманда));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиОбновить() Экспорт
	НовостиОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовостиОбновить(Команда)
	НовостиОбновитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьПровестиНаСервере(Ссылка)
	Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.Проведен Тогда
		Попытка
			Док	= Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Истина
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Ссылка);
		КонецПопытки;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура НовостьПровести() Экспорт
	Если НовостьПровестиНаСервере(НовостьТекущая) Тогда
		Элементы.Новости.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиПриАктивизацииСтроки(Элемент)
	Если Элементы.Новости.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(НовостьТекущая) Тогда
			НовостьТекущая	= Неопределено;
			Комментарий = "";
		КонецЕсли;
	Иначе
		Если Элементы.Новости.ТекущиеДанные.Свойство("Ссылка") Тогда
			Комментарий = Элементы.Новости.ТекущиеДанные.Комментарий;
		Иначе
			Комментарий = "";
		КонецЕсли;
		Если Элементы.Новости.ТекущиеДанные.Свойство("Ссылка") Тогда
			НовостьТекущая	= Элементы.Новости.ТекущиеДанные.Ссылка;
			Если Элементы.Новости.ТекущиеДанные.Свойство("Проведен")
			И НЕ Элементы.Новости.ТекущиеДанные.Проведен
			Тогда
				ПодключитьОбработчикОжидания("НовостьПровести", 3, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьУдалитьНаСервере(Ссылка)
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Новости") Тогда
		Попытка
			Док = Ссылка.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
			Ответ = Истина;
		Исключение КонецПопытки;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Для Каждого Документ Из Ссылка Цикл
			Ответ = Макс(Ответ, НовостьУдалитьНаСервере(Документ));
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура НовостьУдалить()
	Если Элементы.Новости.ТекущиеДанные <> Неопределено
	И Элементы.Новости.ТекущиеДанные.Свойство("Ссылка")
	Тогда
		НовостьТекущая	= Неопределено;
		Комментарий		= "";
		Если Элементы.Новости.ВыделенныеСтроки.Количество() = 1 Тогда
			Если НовостьУдалитьНаСервере(Элементы.Новости.ТекущиеДанные.Ссылка) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		Иначе
			Результат = Новый Массив;
			Для Каждого Проверка Из Элементы.Новости.ВыделенныеСтроки Цикл
				ДанныеПроверки = Элементы.Новости.ДанныеСтроки(Проверка);
				Если ДанныеПроверки = Неопределено Тогда
					//
				ИначеЕсли Результат.Найти(ДанныеПроверки.Ссылка) = Неопределено Тогда
					Результат.Добавить(ДанныеПроверки.Ссылка);
				КонецЕсли;
			КонецЦикла;
			Если НовостьУдалитьНаСервере(Результат) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	НовостьУдалить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВМассивДобавить(Масса, Элемент)
	Если Масса.Найти(Элемент) = Неопределено Тогда
		Масса.Добавить(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандыНайти(Запрос, Знач Наименование)
	Если ЗначениеЗаполнено(Запрос.Параметры.Чемпионат) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЧемпионатыКоманды.Команда КАК Команда,
		               |	ЧемпионатыКоманды.Команда.Наименование ПОДОБНО &Комментарий КАК Пометка
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка = &Чемпионат
		               |	И (ЧемпионатыКоманды.Команда.Наименование ПОДОБНО &Комментарий
		               |			ИЛИ ЧемпионатыКоманды.Команда.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Пометка УБЫВ";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	МатчКоманды.Команда КАК Команда,
		               |	МатчКоманды.Команда.Наименование ПОДОБНО &Комментарий КАК Пометка
		               |ИЗ
		               |	Документ.Матч.Команды КАК МатчКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО МатчКоманды.Ссылка = Матч.Ссылка
		               |ГДЕ
		               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
		               |	И Матч.ПометкаУдаления = ЛОЖЬ
		               |	И (МатчКоманды.Команда.Наименование ПОДОБНО &Комментарий
		               |			ИЛИ МатчКоманды.Команда.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Пометка УБЫВ";
	КонецЕсли;
	Наименование	= СтрЗаменить(Наименование, " - ", " = ");
	Клуб		= "";
	Слова		= Разделить(Наименование);
	ЕстьСчет	= (СтрНайти(Наименование, "=") > 0 И СтрЧислоВхождений(Наименование, ":") > 1);
	Для Каждого Слово Из Слова Цикл
		Если ЕстьСчет Тогда
			Если СтрСравнить(Слово, "=") = 0 Тогда
				Клуб = "";
				Продолжить;
			ИначеЕсли СтрНайти(Слово, ":") > 0 Тогда
				Прервать;
			ИначеЕсли ПустаяСтрока(Клуб) Тогда
				Клуб = Слово;
			Иначе
				Клуб = Клуб + " " + Слово;
			КонецЕсли;
			Запрос.УстановитьПараметр("Комментарий",			Обернуть(Клуб));
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ВМассивДобавить(Запрос.Параметры.Команды, Выборка.Команда);
			КонецЕсли;
		ИначеЕсли СтрНайти(Слово, """") > 0 Тогда
			Запрос.УстановитьПараметр("Комментарий",			Обернуть(Лев(СтрУдалить(Слово, """"), 5)));
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ВМассивДобавить(Запрос.Параметры.Команды, Выборка.Команда);
				Пометка = Выборка.Пометка;
				Пока Выборка.Следующий() И Выборка.Пометка = Пометка Цикл
					ВМассивДобавить(Запрос.Параметры.Команды, Выборка.Команда);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МатчПолучить(Комментарий)
	Уникум = СтрПолучитьСтроку(Комментарий, СтрЧислоСтрок(Комментарий));
	Если СтрДлина(Уникум) = 36 Тогда
		Попытка
			Ответ = Документы.Матч.ПолучитьСсылку(Новый УникальныйИдентификатор(Уникум));
			Если ЗначениеЗаполнено(Ответ.Дата) Тогда
				Возврат Ответ;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Документы.Матч.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаПодобрать(Ссылка)
	Ответ = Неопределено;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Новости") Тогда
		Ответ	= МатчПолучить(Ссылка.Комментарий);
		Если ЗначениеЗаполнено(Ответ) Тогда
			Возврат Ответ;
		КонецЕсли;
		ЧислоСтрок	= СтрЧислоСтрок(Ссылка.Комментарий);
		Комментарий = СтрУдалить(Ссылка.Комментарий, Разделить(". ,"));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаН",				Ссылка.Дата - Сутки(7));
		Запрос.УстановитьПараметр("ДатаК",				Ссылка.Дата + Сутки());
		Запрос.УстановитьПараметр("Чемпионат",			Неопределено);
		Запрос.УстановитьПараметр("Команды",			Новый Массив);
		Для НомерСтроки = 1 По ЧислоСтрок Цикл
			Если ЗначениеЗаполнено(Ответ) Тогда Прервать; КонецЕсли;
			Наименование = СтрПолучитьСтроку(Комментарий, НомерСтроки);
			Слова = Разделить(Наименование);
			Если Слова.Количество() = 0 Тогда
				//
			ИначеЕсли ЗначениеЗаполнено(Запрос.Параметры.Чемпионат) Тогда
				КомандыНайти(Запрос, Наименование);
			Иначе
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Чемпионаты.Ссылка КАК Ссылка
				               |ИЗ
				               |	Справочник.Чемпионаты КАК Чемпионаты
				               |ГДЕ
				               |	Чемпионаты.ПометкаУдаления = ЛОЖЬ
				               |	И &ДатаН МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания
				               |	И (Чемпионаты.Наименование ПОДОБНО &Комментарий
				               |			ИЛИ Чемпионаты.Комментарий ПОДОБНО &Комментарий)
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Чемпионаты.ДатаОкончания УБЫВ";
				Если Слова.Количество() = 1 Тогда
					Запрос.УстановитьПараметр("Комментарий",			Обернуть(Слова.Получить(0)));
				Иначе
					Запрос.УстановитьПараметр("Комментарий",			Обернуть(Слова.Получить(0) + "%" + Слова.Получить(1)));
				КонецЕсли;
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запрос.УстановитьПараметр("Чемпионат",				Выборка.Ссылка);
					КомандыНайти(Запрос, Наименование);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		КомандыНайти(Запрос, Ссылка.Наименование);
		Если Запрос.Параметры.Команды.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Запрос.Параметры.Чемпионат) Тогда
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				               |	МатчКоманды.Ссылка КАК Ссылка,
				               |	Матч.Дата КАК Дата
				               |ИЗ
				               |	Документ.Матч.Команды КАК МатчКоманды
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
				               |		ПО МатчКоманды.Ссылка = Матч.Ссылка
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Противники
				               |		ПО МатчКоманды.Ссылка = Противники.Ссылка
				               |			И МатчКоманды.Команда <> Противники.Команда
				               |ГДЕ
				               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
				               |	И Матч.ПометкаУдаления = ЛОЖЬ
				               |	И Матч.Тур.Владелец = &Чемпионат
				               |	И МатчКоманды.Команда В(&Команды)
				               |	И Противники.Команда В(&Команды)
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Дата УБЫВ";
			Иначе
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
				               |	Матч.Ссылка КАК Ссылка
				               |ИЗ
				               |	Документ.Матч.Команды КАК МатчКоманды
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
				               |		ПО МатчКоманды.Ссылка = Матч.Ссылка
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Противники
				               |		ПО МатчКоманды.Ссылка = Противники.Ссылка
				               |			И МатчКоманды.Команда <> Противники.Команда
				               |ГДЕ
				               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
				               |	И Матч.ПометкаУдаления = ЛОЖЬ
				               |	И МатчКоманды.Команда В(&Команды)
				               |	И Противники.Команда В(&Команды)
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Матч.Дата УБЫВ";
			КонецЕсли;
			Если Запрос.Параметры.Команды.Количество() = 1 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Противники.Команда В(&Команды)", "");
			КонецЕсли;
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Ответ = Выборка.Ссылка;
				Если Выборка.Количество() = 1 Тогда
					Попытка
						Док = Ссылка.ПолучитьОбъект();
						Если СтрНайти(Док.Комментарий, Выборка.Ссылка.УникальныйИдентификатор()) = 0 Тогда
							Док.Комментарий	= Док.Комментарий + Разрыв() + Выборка.Ссылка.УникальныйИдентификатор();
							Док.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
					Исключение КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура НовостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(СсылкаПодобрать(ВыбраннаяСтрока), СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
		НовостьПровести();
	КонецЕсли;
КонецПроцедуры
